In [1]:
import numpy as np
import pandas as pd
PREVIOUS_MAX_ROWS = pd.options.display.max_rows
pd.options.display.max_rows = 20
np.random.seed(12345)

In [2]:
import matplotlib.pyplot as plt
plt.rc('figure', figsize=(10, 6))
np.set_printoptions(precision=4, suppress=True)

In [3]:
#Handling Missing Data
string_data = pd.Series(['aardvark', 'artichoke', np.nan, 'avocado'])
string_data
string_data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [4]:
# asssign the first value as zero & check
string_data[0] = None
string_data.isnull()

0     True
1    False
2     True
3    False
dtype: bool

In [5]:
##Filtering Out Missing Data
from numpy import nan as NA
data = pd.Series([1, NA, 3.5, NA, 7])
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [6]:
# another method
data[data.notnull()]

0    1.0
2    3.5
4    7.0
dtype: float64

In [7]:
data = pd.DataFrame([[1., 6.5, 3.], [1., NA, NA],
[NA, NA, NA], [NA, 6.5, 3.]])

data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [8]:
cleaned = data.dropna()
cleaned

     0    1    2
0  1.0  6.5  3.0

In [9]:
# Drop all row has NAN
data.dropna(how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [10]:
# Drop all Na in Column
data[4] = NA
data

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [11]:
data.dropna(axis=1, how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [12]:
# Maintain minimum non null value as per thersold values
df = pd.DataFrame(np.random.randn(7, 3))
df.iloc[:4, 1] = NA
df.iloc[:2, 2] = NA
df
df.dropna()
df.dropna(thresh=2)

          0         1         2
2  0.092908       NaN  0.769023
3  1.246435       NaN -1.296221
4  0.274992  0.228913  1.352917
5  0.886429 -2.001637 -0.371843
6  1.669025 -0.438570 -0.539741

In [13]:
##Filling In Missing Data
df.fillna(0)

          0         1         2
0 -0.204708  0.000000  0.000000
1 -0.555730  0.000000  0.000000
2  0.092908  0.000000  0.769023
3  1.246435  0.000000 -1.296221
4  0.274992  0.228913  1.352917
5  0.886429 -2.001637 -0.371843
6  1.669025 -0.438570 -0.539741

In [14]:
# Fill with specific value with specific column
df.fillna({1: 0.5, 2: "Hi"})

          0         1         2
0 -0.204708  0.500000        Hi
1 -0.555730  0.500000        Hi
2  0.092908  0.500000  0.769023
3  1.246435  0.500000  -1.29622
4  0.274992  0.228913   1.35292
5  0.886429 -2.001637 -0.371843
6  1.669025 -0.438570 -0.539741

In [15]:
# fill paramanet
_= df.fillna(10, inplace=True)
df

          0          1          2
0 -0.204708  10.000000  10.000000
1 -0.555730  10.000000  10.000000
2  0.092908  10.000000   0.769023
3  1.246435  10.000000  -1.296221
4  0.274992   0.228913   1.352917
5  0.886429  -2.001637  -0.371843
6  1.669025  -0.438570  -0.539741

In [16]:
# Fowrd ward fill
df = pd.DataFrame(np.random.randn(6, 3))
df.iloc[2:, 1] = NA
df.iloc[4:, 2] = NA
df

          0         1         2
0  0.476985  3.248944 -1.021228
1 -0.577087  0.124121  0.302614
2  0.523772       NaN  1.343810
3 -0.713544       NaN -2.370232
4 -1.860761       NaN       NaN
5 -1.265934       NaN       NaN

In [17]:
# Forward fill all NAN
df.fillna(method='ffill')
# Forward fill upto limit
df.fillna(method='ffill', limit=2)

          0         1         2
0  0.476985  3.248944 -1.021228
1 -0.577087  0.124121  0.302614
2  0.523772  0.124121  1.343810
3 -0.713544  0.124121 -2.370232
4 -1.860761       NaN -2.370232
5 -1.265934       NaN -2.370232

In [18]:
# Find the mean & fill with mean value
data = pd.Series([1., NA, 3.5, NA, 7])
data.fillna(data.mean())

0    1.000000
1    3.833333
2    3.500000
3    3.833333
4    7.000000
dtype: float64

In [19]:
##Removing Duplicates
data = pd.DataFrame({'k1': ['one', 'two'] * 3 + ['two'],
'k2': [1, 1, 2, 3, 3, 4, 4]})
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [20]:
data.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [21]:
data.drop_duplicates()

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

In [22]:
data['v1'] =range(7)
data

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
5  two   4   5
6  two   4   6

In [23]:
# Drop key wise
data.drop_duplicates('k1')

    k1  k2  v1
0  one   1   0
1  two   1   1

In [24]:
# Drop both k1 & k2 duplicate
# 5 & 6 row both keys are common - so 6th row will be removed
data.drop_duplicates(['k1', 'k2'])

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
5  two   4   5

In [25]:
# But I want 6th row ,then give keep last option
data.drop_duplicates(['k1', 'k2'], keep='last')

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
6  two   4   6

In [26]:
##Transforming Data Using a Lambda Function

In [27]:
data = pd.DataFrame({'food': ['bacon', 'pulled pork', 'bacon',
'Pastrami', 'corned beef', 'Bacon',
'pastrami', 'honey ham', 'nova lox'],
'ounces': [4, 3, 12, 6, 7.5, 8, 3, 5, 6]})
data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     Pastrami     6.0
4  corned beef     7.5
5        Bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

In [28]:
meat_to_animal = {
'bacon': 'pig',
'pulled pork': 'pig',
'pastrami': 'cow',
'corned beef': 'cow',
'honey ham': 'pig',
'nova lox': 'salmon'
}

In [29]:
# convert the food string to lowercase
lowercased = data['food'].str.lower()
lowercased

0          bacon
1    pulled pork
2          bacon
3       pastrami
4    corned beef
5          bacon
6       pastrami
7      honey ham
8       nova lox
Name: food, dtype: object

In [30]:
# create the new column as animal & map the values only from meat to animal dict
data['animal'] = lowercased.map(meat_to_animal)
data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     Pastrami     6.0     cow
4  corned beef     7.5     cow
5        Bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

In [31]:
# insead of creating new column & covert as lower case & map
# using lambda call the dictionary element value & convert lower case - map
data['food'].map(lambda x: meat_to_animal[x.lower()])

0       pig
1       pig
2       pig
3       cow
4       cow
5       pig
6       cow
7       pig
8    salmon
Name: food, dtype: object

In [32]:
data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     Pastrami     6.0     cow
4  corned beef     7.5     cow
5        Bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

In [33]:
#Replacing Values inplace of missing values

In [34]:
data = pd.Series([1., -899., 2., -999., -1000., 3.])
data

0       1.0
1    -899.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

In [35]:
#signle element
data.replace(-999, np.nan)

0       1.0
1    -899.0
2       2.0
3       NaN
4   -1000.0
5       3.0
dtype: float64

In [36]:
# Two element common value
data.replace([-899, -1000], np.nan)

0      1.0
1      NaN
2      2.0
3   -999.0
4      NaN
5      3.0
dtype: float64

In [37]:
# more than one value with more than one value replace
data.replace([-899,-999, -1000], [np.nan,np.nan, 0])

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [38]:
# using dict map
data.replace({-999: np.nan, -1000: 0})

0      1.0
1   -899.0
2      2.0
3      NaN
4      0.0
5      3.0
dtype: float64

In [39]:
#Renaming Axis Indexes

In [40]:
data = pd.DataFrame(np.arange(12).reshape((3, 4)),
index=['Ohio', 'Colorado', 'New York'],
columns=['one', 'two', 'three', 'four'])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

In [41]:
# Create the lambda object
lambda x: x.upper()

In [42]:
# map the lambda object
transform = lambda x: x.upper()
data.index.map(transform)

Index(['OHIO', 'COLORADO', 'NEW YORK'], dtype='object')

In [43]:
# Set index temporay
data.index = data.index.map(transform)
data

          one  two  three  four
OHIO        0    1      2     3
COLORADO    4    5      6     7
NEW YORK    8    9     10    11

In [44]:
# Rename the column header
data.rename(columns=str.upper)

          ONE  TWO  THREE  FOUR
OHIO        0    1      2     3
COLORADO    4    5      6     7
NEW YORK    8    9     10    11

In [45]:
print(str.title)

<method 'title' of 'str' objects>

In [46]:
data.rename(index=str.title, columns=str.upper)

          ONE  TWO  THREE  FOUR
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

In [47]:
data.rename(index={'OHIO': 'INDIANA'},
columns={'three': 'peekaboo'})

          one  two  peekaboo  four
INDIANA     0    1         2     3
COLORADO    4    5         6     7
NEW YORK    8    9        10    11

In [48]:
# Paramament
data.rename(index={'OHIO': 'INDIANA'}, inplace=True)
data

          one  two  three  four
INDIANA     0    1      2     3
COLORADO    4    5      6     7
NEW YORK    8    9     10    11

### binning or bucketizing for continuous variables

In [49]:
ages = [20, 22, 25, 27, 21, 23, 37, 31, 61, 45, 41, 32]

In [50]:
# Will cut & put into respective bin, Example age 20 will come under 18 to 25
bins = [18, 25, 35, 60, 100]
cats = pd.cut(ages, bins)
cats

[(18, 25], (18, 25], (18, 25], (25, 35], (18, 25], ..., (25, 35], (60, 100], (35, 60], (35, 60], (25, 35]]
Length: 12
Categories (4, interval[int64]): [(18, 25] < (25, 35] < (35, 60] < (60, 100]]

In [51]:
# Provide the 4 interval 0,1,2,3,4   ( 0 means 18-25) or convert binning of 0,1,2,3
cats.codes

array([0, 0, 0, 1, 0, 0, 2, 1, 3, 2, 2, 1], dtype=int8)

In [52]:
# Provide categories
cats.categories

IntervalIndex([(18, 25], (25, 35], (35, 60], (60, 100]],
              closed='right',
              dtype='interval[int64]')

In [53]:
# provide how many values for each cat
pd.value_counts(cats)

(18, 25]     5
(35, 60]     3
(25, 35]     3
(60, 100]    1
dtype: int64

In [58]:
# Provide the bin value as list , Include right most or not
pd.cut(ages, [18, 25, 35, 60, 100], right=False)

[[18, 25), [18, 25), [25, 35), [25, 35), [18, 25), ..., [25, 35), [60, 100), [35, 60), [35, 60), [25, 35)]
Length: 12
Categories (4, interval[int64]): [[18, 25) < [25, 35) < [35, 60) < [60, 100)]

In [63]:
group_names = ['Youth', 'YoungAdult', 'MiddleAged', 'Senior']
pd.cut(ages, bins, labels=group_names)

[Youth, Youth, Youth, YoungAdult, Youth, ..., YoungAdult, Senior, MiddleAged, MiddleAged, YoungAdult]
Length: 12
Categories (4, object): [Youth < YoungAdult < MiddleAged < Senior]

In [59]:
import pandas as pd 
import numpy as np 
  
df = pd.DataFrame({'number': np.random.randint(1, 100, 10)}) 
df['bins'] = pd.cut(x=df['number'], bins=[1, 20, 40, 60, 80, 100], 
                    labels=['1 to 20', '21 to 40', '41 to 60', 
                            '61 to 80', '81 to 100']) 
  
print(df) 
  
# We can check the frequency of each bin 
print(df['bins'].unique())

   number       bins
0      38   21 to 40
1      73   61 to 80
2      44   41 to 60
3      63   61 to 80
4      87  81 to 100
5      22   21 to 40
6      66   61 to 80
7      97  81 to 100
8       6    1 to 20
9      63   61 to 80
[21 to 40, 61 to 80, 41 to 60, 81 to 100, 1 to 20]
Categories (5, object): [1 to 20 < 21 to 40 < 41 to 60 < 61 to 80 < 81 to 100]

In [64]:
# Create the random data and cat into 4 groups
data = np.random.rand(20)
pd.cut(data, 4, precision=2)

[(0.75, 0.98], (0.082, 0.31], (0.53, 0.75], (0.75, 0.98], (0.53, 0.75], ..., (0.31, 0.53], (0.53, 0.75], (0.53, 0.75], (0.31, 0.53], (0.31, 0.53]]
Length: 20
Categories (4, interval[float64]): [(0.082, 0.31] < (0.31, 0.53] < (0.53, 0.75] < (0.75, 0.98]]

### quartile cut

In [65]:
data = np.random.randn(1000) # Normally distributed
cats = pd.qcut(data, 4) # Cut into quartiles
cats
pd.value_counts(cats)

(0.636, 3.217]                  250
(-0.0704, 0.636]                250
(-0.63, -0.0704]                250
(-2.9019999999999997, -0.63]    250
dtype: int64

In [68]:
cats = pd.qcut(data, [0, 0.1, 0.5, 0.9, 1.])
cats
pd.value_counts(cats)

(-0.0704, 1.257]                 400
(-1.195, -0.0704]                400
(1.257, 3.217]                   100
(-2.9019999999999997, -1.195]    100
dtype: int64

##  filter out the outliers

In [69]:
data = pd.DataFrame(np.random.randn(1000, 4))
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean     -0.046216    -0.023190    -0.029374     0.000352
std       1.002905     0.997148     1.012412     0.990585
min      -3.187784    -2.934568    -3.812984    -2.748516
25%      -0.697383    -0.688327    -0.707739    -0.659591
50%      -0.028499    -0.041489    -0.056246     0.024598
75%       0.645538     0.618051     0.697902     0.660306
max       3.513777     3.477675     2.718222     3.363466

In [73]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 4 columns):
0    1000 non-null float64
1    1000 non-null float64
2    1000 non-null float64
3    1000 non-null float64
dtypes: float64(4)
memory usage: 31.3 KB

In [70]:
# Filter the column 2 & take absulate value for more then 3 
col = data[2]
col[np.abs(col) > 3]

15    -3.105453
127   -3.812984
586   -3.664025
Name: 2, dtype: float64

In [71]:
# Filter the column value more than 3 absulate value
data[(np.abs(data) > 3).any(1)]

            0         1         2         3
15  -0.958620  0.267005 -3.105453  1.257237
111 -0.946487  3.100805 -1.320509  1.720393
127  0.552412 -1.451778 -3.812984 -0.461761
189  3.513777  1.923768 -0.667283 -0.262455
342  0.037474  0.601002  0.803782  3.363466
404 -3.051999 -1.828086 -0.349763  0.285649
548 -3.187784 -2.052495 -0.676430  0.372812
586  1.350441 -0.949437 -3.664025  2.046295
601 -0.070477 -0.175003  1.122770  3.278531
688 -0.025481  1.434030 -0.170217  3.250855
711 -0.020040  3.389123  1.302207 -0.440508
862 -0.149653  3.477675  1.176748  0.592325

In [74]:
data[np.abs(data) > 3] = np.sign(data) * 3
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean     -0.046490    -0.024157    -0.027792    -0.000541
std       1.000482     0.994010     1.007199     0.987736
min      -3.000000    -2.934568    -3.000000    -2.748516
25%      -0.697383    -0.688327    -0.707739    -0.659591
50%      -0.028499    -0.041489    -0.056246     0.024598
75%       0.645538     0.618051     0.697902     0.660306
max       3.000000     3.000000     2.718222     3.000000

In [75]:
np.sign(data).head()

     0    1    2    3
0 -1.0 -1.0 -1.0 -1.0
1  1.0  1.0  1.0 -1.0
2 -1.0  1.0  1.0  1.0
3  1.0 -1.0 -1.0 -1.0
4  1.0  1.0 -1.0 -1.0

### reshaping data

In [76]:
import numpy as np
import pandas as pd
pd.options.display.max_rows = 20
np.random.seed(12345)
import matplotlib.pyplot as plt
plt.rc('figure', figsize=(10, 6))
np.set_printoptions(precision=4, suppress=True)

In [78]:
# Multi index
data = pd.Series(np.random.randn(9),
index=[['a', 'a', 'a', 'b', 'b', 'c', 'c', 'd', 'd'],
[1, 2, 3, 1, 3, 1, 2, 2, 3]])
data

a  1    1.246435
   2    1.007189
   3   -1.296221
b  1    0.274992
   3    0.228913
c  1    1.352917
   2    0.886429
d  2   -2.001637
   3   -0.371843
dtype: float64

In [79]:
data.index

MultiIndex(levels=[['a', 'b', 'c', 'd'], [1, 2, 3]],
           codes=[[0, 0, 0, 1, 1, 2, 2, 3, 3], [0, 1, 2, 0, 2, 0, 1, 1, 2]])

In [80]:
data['b']

1    0.274992
3    0.228913
dtype: float64

In [81]:
data['b':'d']

b  1    0.274992
   3    0.228913
c  1    1.352917
   2    0.886429
d  2   -2.001637
   3   -0.371843
dtype: float64

In [82]:
data.loc[['b', 'd']]

b  1    0.274992
   3    0.228913
d  2   -2.001637
   3   -0.371843
dtype: float64

In [83]:
data.loc[:, 2]

a    1.007189
c    0.886429
d   -2.001637
dtype: float64

In [84]:
data

a  1    1.246435
   2    1.007189
   3   -1.296221
b  1    0.274992
   3    0.228913
c  1    1.352917
   2    0.886429
d  2   -2.001637
   3   -0.371843
dtype: float64

In [85]:
data.unstack()

          1         2         3
a  1.246435  1.007189 -1.296221
b  0.274992       NaN  0.228913
c  1.352917  0.886429       NaN
d       NaN -2.001637 -0.371843

In [86]:
data.unstack().stack()

a  1    1.246435
   2    1.007189
   3   -1.296221
b  1    0.274992
   3    0.228913
c  1    1.352917
   2    0.886429
d  2   -2.001637
   3   -0.371843
dtype: float64

In [87]:
# multi index , multi column name
frame = pd.DataFrame(np.arange(12).reshape((4, 3)),
index=[['a', 'a', 'b', 'b'], [1, 2, 1, 2]],
columns=[['Ohio', 'Ohio', 'Colorado'],
['Green', 'Red', 'Green']])
frame

     Ohio     Colorado
    Green Red    Green
a 1     0   1        2
  2     3   4        5
b 1     6   7        8
  2     9  10       11

In [88]:
frame.index.names = ['key1', 'key2']
frame.columns.names = ['state', 'color']
frame

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
     2        3   4        5
b    1        6   7        8
     2        9  10       11

In [91]:
frame['Ohio']

color      Green  Red
key1 key2
a    1         0    1
     2         3    4
b    1         6    7
     2         9   10

In [98]:
# Check the column level
frame.columns.levels

FrozenList([['Colorado', 'Ohio'], ['Green', 'Red']])

In [99]:
# check index level
frame.index.levels

FrozenList([['a', 'b'], [1, 2]])

In [108]:
# access row value
frame.loc[('a',1)]

state     color
Ohio      Green    0
          Red      1
Colorado  Green    2
Name: (a, 1), dtype: int32

In [109]:
# Swap the key
frame.swaplevel('key1', 'key2')

state      Ohio     Colorado
color     Green Red    Green
key2 key1
1    a        0   1        2
2    a        3   4        5
1    b        6   7        8
2    b        9  10       11

In [110]:
# Sort index
frame.sort_index(level=1)

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
b    1        6   7        8
a    2        3   4        5
b    2        9  10       11

In [111]:
# Swap & short index
frame.swaplevel(0, 1).sort_index(level=0)

state      Ohio     Colorado
color     Green Red    Green
key2 key1
1    a        0   1        2
     b        6   7        8
2    a        3   4        5
     b        9  10       11